bench/async-kafka/async-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/patient-create.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * patients: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 352 complete and 0 interrupted iterations
patients   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 655 complete and 0 interrupted iterations
patients   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 1161 complete and 0 interrupted iterations
patients   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 1670 complete and 0 interrupted iterations
patients   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 2189 complete and 0 interrupted iterations
patients   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 2935 complete and 0 interrupted iterations
patients   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 3780 complete and 0 interrupted iterations
patients   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 4531 complete and 0 interrupted iterations
patients   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 5214 complete and 0 interrupted iterations
patients   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 5949 complete and 0 interrupted iterations
patients   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 6666 complete and 0 interrupted iterations
patients   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 7422 complete and 0 interrupted iterations
patients   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 8194 complete and 0 interrupted iterations
patients   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 8904 complete and 0 interrupted iterations
patients   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 9524 complete and 0 interrupted iterations
patients   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 10169 complete and 0 interrupted iterations
patients   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 10853 complete and 0 interrupted iterations
patients   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 11441 complete and 0 interrupted iterations
patients   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 12254 complete and 0 interrupted iterations
patients   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 12895 complete and 0 interrupted iterations
patients   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 13537 complete and 0 interrupted iterations
patients   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 14176 complete and 0 interrupted iterations
patients   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 14941 complete and 0 interrupted iterations
patients   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 15713 complete and 0 interrupted iterations
patients   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 16394 complete and 0 interrupted iterations
patients   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 17075 complete and 0 interrupted iterations
patients   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 17823 complete and 0 interrupted iterations
patients   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 18558 complete and 0 interrupted iterations
patients   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 18887 complete and 0 interrupted iterations
patients   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 19135 complete and 0 interrupted iterations
patients   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 19400 complete and 0 interrupted iterations
patients   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 19884 complete and 0 interrupted iterations
patients   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 20523 complete and 0 interrupted iterations
patients   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 21128 complete and 0 interrupted iterations
patients   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 21531 complete and 0 interrupted iterations
patients   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 21994 complete and 0 interrupted iterations
patients   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 22479 complete and 0 interrupted iterations
patients   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 23074 complete and 0 interrupted iterations
patients   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 23664 complete and 0 interrupted iterations
patients   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 24106 complete and 0 interrupted iterations
patients   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 24558 complete and 0 interrupted iterations
patients   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 25069 complete and 0 interrupted iterations
patients   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 25550 complete and 0 interrupted iterations
patients   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 26048 complete and 0 interrupted iterations
patients   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 26625 complete and 0 interrupted iterations
patients   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 27205 complete and 0 interrupted iterations
patients   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 27832 complete and 0 interrupted iterations
patients   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 28487 complete and 0 interrupted iterations
patients   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 29354 complete and 0 interrupted iterations
patients   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 30124 complete and 0 interrupted iterations
patients   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 30957 complete and 0 interrupted iterations
patients   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 31433 complete and 0 interrupted iterations
patients   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 32139 complete and 0 interrupted iterations
patients   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 33008 complete and 0 interrupted iterations
patients   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 33833 complete and 0 interrupted iterations
patients   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 34567 complete and 0 interrupted iterations
patients   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 35312 complete and 0 interrupted iterations
patients   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 36041 complete and 0 interrupted iterations
patients   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 36934 complete and 0 interrupted iterations
patients   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 37856 complete and 0 interrupted iterations
patients   [ 100% ] 10 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 37872   630.98393/s
    checks_succeeded...: 100.00% 37872 out of 37872
    checks_failed......: 0.00%   0 out of 37872

    ✓ created

    HTTP
    http_req_duration..............: avg=15.66ms med=12.86ms p(90)=24.57ms p(95)=31.74ms p(99)=54.3ms  max=255.82ms
      { expected_response:true }...: avg=15.66ms med=12.86ms p(90)=24.57ms p(95)=31.74ms p(99)=54.3ms  max=255.82ms
    http_req_failed................: 0.00% 0 out of 37872
    http_reqs......................: 37872 630.98393/s

    EXECUTION
    iteration_duration.............: avg=15.83ms med=13.02ms p(90)=24.75ms p(95)=31.9ms  p(99)=54.55ms max=256.07ms
    iterations.....................: 37872 630.98393/s
    vus............................: 10    min=10         max=10
    vus_max........................: 10    min=10         max=10

    NETWORK
    data_received..................: 12 MB 204 kB/s
    data_sent......................: 19 MB 321 kB/s



running (1m00.0s), 00/10 VUs, 37872 complete and 0 interrupted iterations
patients ✓ [ 100% ] 10 VUs  1m0s